app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "crypted_password" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["crypted_password", "$2a$10$A//7iuA.QWWSC0JYac9jMOvGOxb2.azijsfYR6ch6fUFD2z6YmZra"], ["salt", "jzebzkxsGcXeoMrzRXZw"], ["updated_at", "2014-11-26 10:01:49.781469"]]